app/views/dashboard/index.html.erb

SELECT "activities".* FROM "activities"  WHERE "activities"."recipient_id" IN (103, 105) AND "activities"."trackable_type" = 'Subscription'  ORDER BY created_at desc
---
					</li>
					<% subscription_activities = PublicActivity::Activity.order("created_at desc").where(:recipient_id => current_user.event_ids, trackable_type: "Subscription")%>