app/views/public_activity/subscription/_subscribed.html.erb

SELECT  "atw_users".* FROM "atw_users"  WHERE "atw_users"."id" = 1 LIMIT 1
---
<% user = User.find_by_id(activity.owner_id) %>