app/views/public_activity/subscription/_unsubscribed.html.erb

SELECT  "atw_users".* FROM "atw_users"  WHERE "atw_users"."id" IS NULL LIMIT 1
---
<% user = User.find_by_id(activity.owner_id) %>