app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"   ORDER BY created_at desc
---
	def index
		@activities = PublicActivity::Activity.order("created_at desc")