app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
        @event.create_activity :create, owner: User.find_by_id(@event.owner)
---
INSERT INTO "activities" ("created_at", "key", "owner_id", "owner_type", "parameters", "trackable_id", "trackable_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "atw_users".* FROM "atw_users"  WHERE "atw_users"."id" = 1 LIMIT 1