app/controllers/subscriptions_controller.rb

INSERT INTO "activities" ("created_at", "key", "owner_id", "owner_type", "parameters", "recipient_id", "recipient_type", "trackable_id", "trackable_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "atw_users".* FROM "atw_users"  WHERE "atw_users"."id" = 2 LIMIT 1
---
  def destroy
    @subscription.create_activity :unsubscribed, owner: User.find_by_id(@subscription.user_id),
                                                 recipient: Event.find_by_id(@subscription.event_id)