app/controllers/users_controller.rb

    def set_user
      @user = User.friendly.find(params[:id])
---
SELECT  "atw_users".* FROM "atw_users"  WHERE "atw_users"."id" = ? LIMIT 1  [["id", 2]]